In [15]:
import pandas as pd

# 1.Read the data from the CSVfile into a DataFrameand display the first five rows.

In [16]:
df_avocado= pd.read_csv("avocado.csv")

In [17]:
df_avocado.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

# 2.Check to see if any of the columns have missing values.

In [18]:
df_avocado.isnull().any()

Unnamed: 0      False
Date            False
AveragePrice    False
Total Volume    False
4046            False
4225            False
4770            False
Total Bags      False
Small Bags      False
Large Bags      False
XLarge Bags     False
type            False
year            False
region          False
dtype: bool

# 3.Display the unique values in the region column, and notice that one of the regions is TotalUS.

In [19]:
df_avocado.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

# 4.Drop rows that have a region of TotalUS, and then check to see how many rows were dropped

In [20]:
df_avocado = df_avocado.query('region == "TotalUS"')

In [21]:
df_avocado.region.value_counts()

region
TotalUS    338
Name: count, dtype: int64

# 5.Drop the Unnamed: 0, 4046, 4225, and 4770 columns

In [22]:
df_avocado.drop(columns=['Unnamed: 0','4046','4225','4770'],inplace=True)

# 6.Convert the Date column to the DateTime type.

In [23]:
df_avocado['Date']=df_avocado['Date'].apply(pd.to_datetime)

# 7.Check that these changes have been applied to the DataFrame.

In [24]:
df_avocado.info()

<class 'pandas.core.frame.DataFrame'>
Index: 338 entries, 2652 to 18224
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          338 non-null    datetime64[ns]
 1   AveragePrice  338 non-null    float64
 2   Total Volume  338 non-null    float64
 3   Total Bags    338 non-null    float64
 4   Small Bags    338 non-null    float64
 5   Large Bags    338 non-null    float64
 6   XLarge Bags   338 non-null    float64
 7   type          338 non-null    object
 8   year          338 non-null    int64
 9   region        338 non-null    object
dtypes: datetime64[ns](1), float64(6), int64(1), object(2)
memory usage: 29.0+ KB